# Terminal tools
brew "zsh"
brew "asdf"
brew "curl"
brew "fd"
brew "bat"
brew "exa"
brew "neovim"
brew "tmux"
brew "git"
brew "gitui"
brew "git-delta"
cask "iterm2"

# programming
cask "docker"
cask "docker-compose"
brew "node"
brew "yarn"

# Applications
brew "mas"
cask "discord"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask "notion"
cask "bear"
cask "1password"
cask "1password-cli"
cask "alfred"

# fonts
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-noto-sans-cjk"
cask "font-noto-sans-cjk-kr"
