# Terminal tools
brew "zsh"
brew "starship"
brew "zoxide"
brew "coreutils"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "asdf"
brew "curl"
brew "fd"
brew "bat"
brew "exa"
brew "neovim"
brew "tmux"
brew "git"
brew "gitui"
brew "git-delta"
cask "ghostty"

# programming
cask "docker-desktop"
brew "node"
brew "yarn"
brew "uv"
brew "ruff"

# Applications
brew "mas"
cask "discord"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask "notion"
cask "1password"
cask "1password-cli"
cask "alfred"

# fonts
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-noto-sans-cjk"
cask "font-noto-sans-cjk-kr"
