# Core
zsh
tmux
git
curl
wget
unzip
build-essential

# CLI tools
fzf
fd-find
bat
nyancat
btop
# neovim — apt version is too old for NvChad; installed via set-neovim target

# Runtime for Mason JS/TS tools (lsp/dap/linter/formatter)
nodejs
npm

# Neovim image/diagram support
imagemagick
luarocks
lua5.1
liblua5.1-0-dev

# Python venv — required by Mason for Python-based packages (debugpy etc.)
python3-venv

# Go runtime — apt version is too old; installed via set-golang target

# Zsh plugins
zsh-autosuggestions
zsh-syntax-highlighting
